#+TITLE: Computational Experiments on Task-based Parallel Applications
#+AUTHOR: Henrique Silva
#+email: hcpsilva@inf.ufrgs.br
#+INFOJS_OPT:
#+PROPERTY: cache yes
#+PROPERTY: results graphics
#+PROPERTY: exports both
#+PROPERTY: tangle yes
#+EXPORT_EXCLUDE_TAGS: noexport

This repository is dedicated to everything related to my scientific initiation
scholarship program. Here I'll keep my daily notes and thoughts, besides all
experiments and other additional information.

** Schedule

   This schedule is subject to change as it hasn't been formally discussed yet.

#+name: schedule
| Day      | Morning       | Afternoon     |
|----------+---------------+---------------|
| Monday   | 09:30 - 12:00 |               |
| Tuesday  | 10:30 - 12:00 | 13:00 - 17:00 |
| Thursday | 10:30 - 12:00 | 13:00 - 17:00 |
| Friday   | 09:30 - 12:00 | 13:00 - 17:00 |

** Schedule Analysis                                               :noexport:

#+header: :var dep0=schedule
#+begin_src R :results output :session :exports both
suppressMessages(library(tidyverse))
library(lubridate)
dep0 %>%
    gather(Variavel, Valor, -Day) %>%
    filter(Valor != "") %>%
    select(-Variavel) %>%
    separate(Valor, into=c("Inicio", "Fim"), sep=" - ") %>%
    mutate(Data = "2019-05-01") %>%
    mutate(Inicio = paste(Data, Inicio),
           Fim = paste(Data, Fim)) %>%
    mutate(Inicio = ymd_hm(Inicio),
           Fim = ymd_hm(Fim)) %>%
    mutate(Segundos = as.duration(interval(Inicio, Fim))) %>%
    select(Day, Segundos, everything()) %>%
    select(-Data) %>%
    group_by(Day) %>%
    summarize(Total = sum(Segundos)/3600) %>%
    as_tibble -> df
df
df %>% pull(Total) %>% sum
# %>%

#+end_src

#+RESULTS:
#+begin_example

# A tibble: 4 x 2
  Day      Total
  <chr>    <dbl>
1 Friday     6.5
2 Monday     2.5
3 Thursday   5.5
4 Tuesday    5.5

[1] 20
#+end_example
** Meeting
*** 2019-04-30 Tips for ORG-Mode                                     :ATTACH:
    :PROPERTIES:
    :Attachments: init.org
    :ID:       428b174d-ec00-474e-b65c-cc8671da1019
    :END:

See the attached file in
[[./data/42/8b174d-ec00-474e-b65c-cc8671da1019/init.org]], or follow the
update instructions [[http://mescal.imag.fr/membres/arnaud.legrand/misc/init.php][here]] that points to the [[https://app-learninglab.inria.fr/gitlab/learning-lab/mooc-rr-ressources/blob/master/module2/ressources/emacs_orgmode.org][learninglab]].
